In [5]:
import pandas as pd

url = "https://www.nimh.nih.gov/health/statistics/suicide"
tables = pd.read_html(url) 
len(tables)

9

In [6]:
tables[0].head()

  Unnamed: 0_level_0                Age Groups                            \
                Rank                       5-9                     10-14
0                  1  Unintentional Injury 684  Unintentional Injury 914
1                  2   Malignant Neoplasms 387               Suicide 481
2                  3  Congenital Anomalies 210   Malignant Neoplasms 463
3                  4              Homicide 187              Homicide 338
4                  5          Heart Disease 77  Congenital Anomalies 192

                                                             \
                         15-24                        25-34
0  Unintentional Injury 14,126  Unintentional Injury 30,163
1                Suicide 5,936                Suicide 8,453
2               Homicide 5,745               Homicide 5,828
3    Malignant Neoplasms 1,463    Malignant Neoplasms 3,503
4            Heart Disease 835          Heart Disease 3,474

                                                             \
                         35-44                        45-54
0  Unintentional Injury 36,159   Malignant Neoplasms 32,867
1         Heart Disease 11,528  Unintentional Injury 30,559
2   Malignant Neoplasms 11,291         Heart Disease 30,430
3                Suicide 8,533          Liver Disease 8,866
4          Liver Disease 5,013                Suicide 7,653

                                          Unnamed: 8_level_0
                         55-64                      All Ages
0  Malignant Neoplasms 101,714         Heart Disease 680,981
1         Heart Disease 79,726   Malignant Neoplasms 613,352
2  Unintentional Injury 33,710  Unintentional Injury 222,698
3     Diabetes Mellitus 15,958       Cerebrovascular 162,639
4                  CLRD 15,748                  CLRD 145,357

In [7]:
for i, t in enumerate(tables):
    print("\n--- TABLE", i, "---")
    print(t.shape)
    display(t.head(2))

--- TABLE 0 ---
(11, 9)

  Unnamed: 0_level_0                Age Groups                            \
                Rank                       5-9                     10-14
0                  1  Unintentional Injury 684  Unintentional Injury 914
1                  2   Malignant Neoplasms 387               Suicide 481

                                                             \
                         15-24                        25-34
0  Unintentional Injury 14,126  Unintentional Injury 30,163
1                Suicide 5,936                Suicide 8,453

                                                             \
                         35-44                        45-54
0  Unintentional Injury 36,159   Malignant Neoplasms 32,867
1         Heart Disease 11,528  Unintentional Injury 30,559

                                         Unnamed: 8_level_0
                         55-64                     All Ages
0  Malignant Neoplasms 101,714        Heart Disease 680,981
1         Heart Disease 79,726  Malignant Neoplasms 613,352

--- TABLE 1 ---
(24, 4)

   Year  Total Population  Female  Male
0  2000              10.4     4.0  17.7
1  2001              10.7     4.1  18.2

--- TABLE 2 ---
(6, 3)

  Age Group  Female  Male
0     10–14     2.1   2.5
1     15–24     5.5  21.2

--- TABLE 3 ---
(5, 3)

  Race and Ethnicity  Female  Male
0              AI/AN    12.4  35.3
1           Asian/PI     3.7  10.3

--- TABLE 4 ---
(5, 2)

  Suicide Method  Number of Deaths
0          Total             49316
1        Firearm             27300

--- TABLE 5 ---
(2, 5)

      Sex  Other  Poisoning  Suffocation  Firearm
0  Female    9.5       29.6         25.9     35.0
1    Male    7.9        7.4         24.0     60.7

--- TABLE 6 ---
(13, 3)

  Demographic Demographic.1  Percent
0     Overall       Overall      5.5
1         Sex        Female      5.5

--- TABLE 7 ---
(13, 3)

  Demographic Demographic.1  Percent
0     Overall       Overall      0.8
1         Sex        Female      0.9

--- TABLE 8 ---
(5, 2)

              Category        Number
0  Thoughts of suicide  14.3 million
1   Made suicide plans   4.6 million

In [8]:
import pandas as pd

url = "https://www.nimh.nih.gov/health/statistics/suicide"
tables = pd.read_html(url)

for i, t in enumerate(tables):
    print("\n--- TABLE", i, "---")
    print("shape:", t.shape)
    print(t.columns)
    display(t.head(2))

--- TABLE 0 ---
shape: (11, 9)
MultiIndex([('Unnamed: 0_level_0',     'Rank'),
            (        'Age Groups',      '5-9'),
            (        'Age Groups',    '10-14'),
            (        'Age Groups',    '15-24'),
            (        'Age Groups',    '25-34'),
            (        'Age Groups',    '35-44'),
            (        'Age Groups',    '45-54'),
            (        'Age Groups',    '55-64'),
            ('Unnamed: 8_level_0', 'All Ages')],
           )

  Unnamed: 0_level_0                Age Groups                            \
                Rank                       5-9                     10-14
0                  1  Unintentional Injury 684  Unintentional Injury 914
1                  2   Malignant Neoplasms 387               Suicide 481

                                                             \
                         15-24                        25-34
0  Unintentional Injury 14,126  Unintentional Injury 30,163
1                Suicide 5,936                Suicide 8,453

                                                             \
                         35-44                        45-54
0  Unintentional Injury 36,159   Malignant Neoplasms 32,867
1         Heart Disease 11,528  Unintentional Injury 30,559

                                         Unnamed: 8_level_0
                         55-64                     All Ages
0  Malignant Neoplasms 101,714        Heart Disease 680,981
1         Heart Disease 79,726  Malignant Neoplasms 613,352

--- TABLE 1 ---
shape: (24, 4)
Index(['Year', 'Total Population', 'Female', 'Male'], dtype='object')

   Year  Total Population  Female  Male
0  2000              10.4     4.0  17.7
1  2001              10.7     4.1  18.2

--- TABLE 2 ---
shape: (6, 3)
Index(['Age Group', 'Female', 'Male'], dtype='object')

  Age Group  Female  Male
0     10–14     2.1   2.5
1     15–24     5.5  21.2

--- TABLE 3 ---
shape: (5, 3)
Index(['Race and Ethnicity', 'Female', 'Male'], dtype='object')

  Race and Ethnicity  Female  Male
0              AI/AN    12.4  35.3
1           Asian/PI     3.7  10.3

--- TABLE 4 ---
shape: (5, 2)
Index(['Suicide Method', 'Number of Deaths'], dtype='object')

  Suicide Method  Number of Deaths
0          Total             49316
1        Firearm             27300

--- TABLE 5 ---
shape: (2, 5)
Index(['Sex', 'Other', 'Poisoning', 'Suffocation', 'Firearm'], dtype='object')

      Sex  Other  Poisoning  Suffocation  Firearm
0  Female    9.5       29.6         25.9     35.0
1    Male    7.9        7.4         24.0     60.7

--- TABLE 6 ---
shape: (13, 3)
Index(['Demographic', 'Demographic.1', 'Percent'], dtype='object')

  Demographic Demographic.1  Percent
0     Overall       Overall      5.5
1         Sex        Female      5.5

--- TABLE 7 ---
shape: (13, 3)
Index(['Demographic', 'Demographic.1', 'Percent'], dtype='object')

  Demographic Demographic.1  Percent
0     Overall       Overall      0.8
1         Sex        Female      0.9

--- TABLE 8 ---
shape: (5, 2)
Index(['Category', 'Number'], dtype='object')

              Category        Number
0  Thoughts of suicide  14.3 million
1   Made suicide plans   4.6 million

In [15]:
import pandas as pd
import os

URL = "https://ourworldindata.org/grapher/suicide-rate-who-mdb.csv"
raw = pd.read_csv(URL)

rate_col = [c for c in raw.columns if c not in ["Entity", "Code", "Year"]][0]

df = raw.rename(columns={
    "Entity": "country",
    "Code": "iso3",
    "Year": "year",
    rate_col: "suicide_rate"
})

df = df[["country", "iso3", "year", "suicide_rate"]]
df["year"] = df["year"].astype(int)
df["suicide_rate"] = pd.to_numeric(df["suicide_rate"], errors="coerce")
df = df.dropna(subset=["suicide_rate"])

df.head(), df.shape

(   country iso3  year  suicide_rate
 0  Albania  ALB  1987      2.474300
 1  Albania  ALB  1988      2.234553
 2  Albania  ALB  1989      2.352273
 3  Albania  ALB  1992      1.604659
 4  Albania  ALB  1993      2.503264,
 (4822, 4))

In [16]:
os.makedirs("reports", exist_ok=True)

In [17]:
table1 = df.sort_values(["country","year"])
table1.to_csv("reports/suicide_rate_year_country.csv", index=False)
table1.head()

   country iso3  year  suicide_rate
0  Albania  ALB  1987      2.474300
1  Albania  ALB  1988      2.234553
2  Albania  ALB  1989      2.352273
3  Albania  ALB  1992      1.604659
4  Albania  ALB  1993      2.503264

In [18]:
latest_year = int(table1["year"].max())
table2 = table1[table1["year"] == latest_year].sort_values("suicide_rate", ascending=False)
table2.to_csv("reports/suicide_rate_top_countries_latest.csv", index=False)
latest_year, table2.head(10)

(2023,
         country iso3  year  suicide_rate
 2941   Mongolia  MNG  2023     15.473985
 2578  Lithuania  LTU  2023     14.655936
 3907   Slovenia  SVN  2023     11.986767
 1979    Hungary  HUN  2023     11.440741
 235   Australia  AUS  2023     10.887463
 4200     Sweden  SWE  2023     10.505647
 2533     Latvia  LVA  2023     10.421383
 2819  Mauritius  MUS  2023     10.222789
 304     Austria  AUT  2023      9.884953
 1117    Czechia  CZE  2023      9.333653)

In [21]:
last_two = (table1.sort_values(["country","year"])
            .groupby("country")
            .tail(2))

table3 = (last_two.groupby("country")
          .apply(lambda g: pd.Series({
              "year_prev": g["year"].iloc[0] if len(g) == 2 else None,
              "rate_prev": g["suicide_rate"].iloc[0] if len(g) == 2 else None,
              "year_latest": g["year"].iloc[-1],
              "rate_latest": g["suicide_rate"].iloc[-1],
          }))
          .reset_index())

table3["delta"] = table3["rate_latest"] - table3["rate_prev"]
table3 = table3.sort_values("rate_latest", ascending=False)
table3.to_csv("reports/suicide_rate_summary_latest.csv", index=False)

table3.head(10)

/var/folders/cn/dlgcdqs952b1y1t9_z8r5d7r0000gn/T/ipykernel_15018/1477555811.py:6: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .apply(lambda g: pd.Series({

           country  year_prev  rate_prev  year_latest  rate_latest     delta
42          Guyana     2019.0  23.479725       2020.0    25.265173  1.785448
101       Suriname     2013.0  24.337643       2014.0    23.955114 -0.382529
114        Uruguay     2021.0  19.593613       2022.0    21.323412  1.729799
98     South Korea     2021.0  19.922537       2022.0    19.023008 -0.899529
10         Belarus     2014.0  15.350015       2018.0    15.478123  0.128108
69        Mongolia     2022.0  17.064290       2023.0    15.473985 -1.590305
59       Lithuania     2022.0  13.749394       2023.0    14.655936  0.906542
52           Japan     2021.0  14.002388       2022.0    14.459399  0.457011
113  United States     2021.0  13.102460       2022.0    13.172756  0.070296
31         Estonia     2021.0  12.003157       2022.0    12.159673  0.156516

In [22]:
import os
os.listdir("reports")[:20]

['suicide_rate_year_country.csv',
 'suicide_rate_top_countries_latest.csv',
 'suicide_rate_summary_latest.csv']